config.org
#+TITLE: Config
#+BABEL: :cache yes
#+PROPERTY: header-args :tangle yes
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
Last Saved: "Mar 16, 2022 Wed"

*** Table of contents                                                                   :TOC_7:
  - [[#default-config][Default Config]]
    - [[#fonts-and-themes][Fonts and Themes]]
    - [[#others][Others]]
    - [[#org-mode-stuff][Org mode stuff]]
      - [[#time-stamp-and-basic-org-defaults][Time Stamp and basic org defaults]]
      - [[#org-babel][Org babel]]
      - [[#org-captures][org captures]]
        -  [[#org-agenda-keywords][org-agenda keywords]]
      - [[#atomic-chrome][Atomic-chrome]]
      - [[#org-super-links][Org super links]]
      - [[#screenshot---windows][Screenshot - Windows]]
      - [[#screenshot-for-chart-gallery][screenshot for chart gallery]]
      - [[#org-roam-and-org-roam-ui][org-roam and org-roam-ui]]
      - [[#org-transclusion][org-transclusion]]
  - [[#functionality][Functionality]]
    - [[#super-save][Super-save]]
    - [[#dired][dired]]
    - [[#dired-sidebar][dired-sidebar]]
  - [[#ui-stuff][UI Stuff]]
  - [[#project-management][Project Management]]
    - [[#skeltor][skeltor]]
  - [[#coding][coding]]
    - [[#gist-managment][gist managment]]
  - [[#voidtools][Voidtools]]
  - [[#workflow-helpers][workflow helpers]]
    - [[#wiki][Wiki]]
    - [[#create-trading-journal-entry][Create Trading Journal Entry]]
  - [[#text-transformations][Text Transformations]]
    - [[#removing-garbage-chars][Removing garbage chars]]
- [[#work][Work]]
  - [[#open-work-tasks][open work tasks]]

** Default Config

#+begin_src emacs-lisp
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

;; Place your private configuration here! Remember, you do not need to run 'doom
;; sync' after modifying this file!


;; Some functionality uses this to identify you, e.g. GPG configuration, email
;; clients, file templates and snippets.
(setq user-full-name "Gopinath Sadasivam"
      user-mail-address "noemail@gopi")

#+end_src

*** Fonts and Themes

Get all fonts present
(princ (font-family-list))

#+begin_src emacs-lisp

;; Doom exposes five (optional) variables for controlling fonts in Doom. Here
;; are the three important ones:
;;
;; + `doom-font'
;; + `doom-variable-pitch-font'
;; + `doom-big-font' -- used for `doom-big-font-mode'; use this for
;;   presentations or streaming.
;;
;; They all accept either a font-spec, font string ("Input Mono-12"), or xlfd
;; font string. You generally only need these two:
;(setq myfont "JetBrainsMonoMedium NF"  myfontsize 16)
(setq myfont "Fira Code Medium"  myfontsize 17)
;(setq myfont "Iosevka Medium"  myfontsize 20)
(setq doom-font (font-spec :family myfont :size myfontsize :weight 'medium)
       doom-variable-pitch-font (font-spec :family "sans" :size 13))
;;(setq doom-font (font-spec :family "Fira Code Medium" :size 17 :weight 'medium)
;;       doom-variable-pitch-font (font-spec :family "sans" :size 13))


;; There are two ways to load a theme. Both assume the theme is installed and
;; available. You can either set `doom-theme' or manually load a theme with the
;; `load-theme' function. This is the default:
(setq doom-theme 'doom-one-light)

#+end_src
*** Others

#+begin_src emacs-lisp

;; If you use `org' and don't want your org files in the default location below,
;; change `org-directory'. It must be set before org loads!
(setq org-directory "~/org/orgagenda")
;(setq org-agenda-root-dir "~/org/orgagenda")

;; This determines the style of line numbers in effect. If set to `nil', line
;; numbers are disabled. For relative line numbers, set this to `relative'.
(setq display-line-numbers-type nil)
(tab-bar-mode)

;; Here are some additional functions/macros that could help you configure Doom:
;;
;; - `load!' for loading external *.el files relative to this one
;; - `use-package!' for configuring packages
;; - `after!' for running code after a package has loaded
;; - `add-load-path!' for adding directories to the `load-path', relative to
;;   this file. Emacs searches the `load-path' when you load packages with
;;   `require' or `use-package'.
;; - `map!' for binding new keys
;;
;; To get information about any of these functions/macros, move the cursor over
;; the highlighted symbol at press 'K' (non-evil users must press 'C-c c k').
;; This will open documentation for it, including demos of how they are used.
;;
;; You can also try 'gd' (or 'C-c c d') to jump to their definition and see how
;; they are implemented.
;;(setq org-superstar-headline-bullets-list '("â—‰" "â—Ž" "âš«" "â—‹" "â–º" "â—‡"))
#+end_src

*** Org mode stuff

**** Time Stamp and basic org defaults

#+begin_src emacs-lisp
(setq
time-stamp-active t          ; do enable time-stamps
time-stamp-pattern "34/\\(\\(L\\|l\\)ast\\( \\|-\\)\\(\\(S\\|s\\)aved\\|\\(M\\|m\\)odified\\|\\(U\\|u\\)pdated\\)\\|Time-stamp\\) *: [\"]%b %02d, %Y %a[\"]")


;; can also add this to source code: // (set-variable time-stamp-format "%04y-%:b-%02d %02H:%02M:%02S")

(add-hook 'before-save-hook 'time-stamp)  ; update time stamps when saving

;; https://emacs.stackexchange.com/questions/62720/open-org-link-in-the-same-window
;; https://emacs.stackexchange.com/questions/16652/change-the-behavior-of-org-mode-auto-expand-relative-path-in-link
(after! org
  (setq org-hide-emphasis-markers t)
  (setq org-link-file-path-type 'relative) ;; insert relative links in org-insert-link
  (setf (cdr (assoc 'file org-link-frame-setup)) 'find-file-other-window))
#+end_src

**** Org babel
#+BEGIN_SRC emacs-lisp
(org-babel-do-load-languages
'org-babel-load-languages
'((python . t)
(shell . t)
(ledger . t)
(plantuml . t)
(napkin . t)
(gnuplot . t)
(haskell . t)
(java . t)
(dot . t)
(sql . t)))

(use-package! ob-napkin :ensure t
              :init
              (with-eval-after-load 'ob
  ;; Optional for syntax highlight of napkin-puml src block.
  ;; (require 'plantuml)
  (require 'ob-napkin)))

(setq org-plantuml-jar-path (expand-file-name "~/.emacs.d/.local/jars/plantuml.jar"))

;; avoid tangling into dos eol in linux files edited using tramp
(add-hook 'org-babel-pre-tangle-hook (lambda () (setq coding-system-for-write 'utf-8-unix)))
#+END_SRC

**** org captures

#+begin_src emacs-lisp
(setq my-org-todo-file "~/org/orgagenda/todo.org")
;(setq life-agenda-file "~/org/orgagenda/life-inbox.org")
;(setq work-agenda-file "~/org/orgagenda/work-inbox.org")

(use-package! doct
  :demand t
  :commands (doct)
  :init (setq org-capture-templates
              (doct '(("TODO"
                       :keys "t"
                       :children (("life"
                                   :keys "l"
                                   :template ("* TODO %^{Description}"
                                              ;;"SCHEDULED: %(org-insert-time-stamp (org-read-date nil t \"+1d\"))"
                                              "%^{SCHEDULED}p"
                                              ":PROPERTIES:"
                                              ":Category: %^{Home|Family|Friends|Learnings|Misc}"
                                              ":END:"
                                              )
                                   :headline "Personal Tasks"
                                   :file my-org-todo-file)
                                  ("work"
                                   :keys "w"
                                   :template ("* TODO %^{Description}"
                                              "%^{SCHEDULED}p"
                                              ":PROPERTIES:"
                                              ":Category: %^{sprint|learning|Misc}"
                                              ":Created: %U"
                                              ":END:"
                                              ":LOGBOOK:"
                                              "- State \"TODO\"       from \"\"           %U"
                                              ":END:")
                                   :headline "Work Tasks"
                                   :file my-org-todo-file)))

                      ("Journal"
                       :keys "j"
                       :prepend t
                       :children (("general"
                                   :keys "g"
                                   :file "~/org/journal/general-journal.org"
                                   :template ("* %?" "%U")
                                   :datetree t)
                                  ("apm-journal"
                                   :keys "a"
                                   :file "c:/my/work/apm-bpm/apmbpm.git/private/agenda/apm-journal.org"
                                   :template ("* %?" "%U")
                                   :datetree t)
                                  ))

                      ))))
#+end_src

